#### UnitSystem Enumeration

---

|  |
| --- |
| See Also |

A system of measurement: Metric or Imperial units.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum UnitSystem ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration UnitSystem ``` |

| Visual C++ |
| --- |
| ``` public enum class UnitSystem ``` |

# Members

| Member name | Description |
| --- | --- |
| Metric | Metric units. |
| Imperial | Imperial units. |

# See Also

Autodesk.Revit.DB Namespace